## staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_quicksight_data_set.notifications_refreshed`         |
|        | `aws_quicksight_refresh_schedule.notifications-refreshed` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
13:23:17.707 STDOUT terraform:   + create
13:23:17.707 STDOUT terraform: Terraform will perform the following actions:
13:23:17.708 STDOUT terraform:   # aws_quicksight_data_set.notifications_refreshed will be created
13:23:17.708 STDOUT terraform:   + resource "aws_quicksight_data_set" "notifications_refreshed" {
13:23:17.708 STDOUT terraform:       + arn            = (known after apply)
13:23:17.708 STDOUT terraform:       + aws_account_id = (known after apply)
13:23:17.708 STDOUT terraform:       + data_set_id    = "notifications-refreshed"
13:23:17.708 STDOUT terraform:       + id             = (known after apply)
13:23:17.708 STDOUT terraform:       + import_mode    = "SPICE"
13:23:17.708 STDOUT terraform:       + name           = "Notifications Refreshing"
13:23:17.708 STDOUT terraform:       + output_columns = (known after apply)
13:23:17.708 STDOUT terraform:       + region         = "ca-central-1"
13:23:17.708 STDOUT terraform:       + tags_all       = (known after apply)
13:23:17.708 STDOUT terraform:       + data_set_usage_configuration (known after apply)
13:23:17.708 STDOUT terraform:       + logical_table_map {
13:23:17.708 STDOUT terraform:           + alias                = "Notifications with Services"
13:23:17.708 STDOUT terraform:           + logical_table_map_id = "notifications-with-services"
13:23:17.708 STDOUT terraform:           + data_transforms (known after apply)
13:23:17.708 STDOUT terraform:           + source {
13:23:17.708 STDOUT terraform:               + data_set_arn      = (known after apply)
13:23:17.708 STDOUT terraform:               + physical_table_id = (known after apply)
13:23:17.708 STDOUT terraform:               + join_instruction {
13:23:17.709 STDOUT terraform:                   + left_operand  = "notifications"
13:23:17.709 STDOUT terraform:                   + on_clause     = "notifications.service_id = services.id"
13:23:17.709 STDOUT terraform:                   + right_operand = "services"
13:23:17.709 STDOUT terraform:                   + type          = "INNER"
13:23:17.709 STDOUT terraform:                   + left_join_key_properties (known after apply)
13:23:17.709 STDOUT terraform:                   + right_join_key_properties (known after apply)
13:23:17.709 STDOUT terraform:                 }
13:23:17.709 STDOUT terraform:             }
13:23:17.709 STDOUT terraform:         }
13:23:17.709 STDOUT terraform:       + permissions {
13:23:17.709 STDOUT terraform:           + actions   = [
13:23:17.709 STDOUT terraform:               + "quicksight:CancelIngestion",
13:23:17.709 STDOUT terraform:               + "quicksight:CreateIngestion",
13:23:17.709 STDOUT terraform:               + "quicksight:DeleteDataSet",
13:23:17.709 STDOUT terraform:               + "quicksight:DescribeDataSet",
13:23:17.709 STDOUT terraform:               + "quicksight:DescribeDataSetPermissions",
13:23:17.709 STDOUT terraform:               + "quicksight:DescribeIngestion",
13:23:17.709 STDOUT terraform:               + "quicksight:ListIngestions",
13:23:17.709 STDOUT terraform:               + "quicksight:PassDataSet",
13:23:17.709 STDOUT terraform:               + "quicksight:UpdateDataSet",
13:23:17.709 STDOUT terraform:               + "quicksight:UpdateDataSetPermissions",
13:23:17.709 STDOUT terraform:             ]
13:23:17.709 STDOUT terraform:           + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
13:23:17.709 STDOUT terraform:         }
13:23:17.709 STDOUT terraform:       + permissions {
13:23:17.709 STDOUT terraform:           + actions   = [
13:23:17.709 STDOUT terraform:               + "quicksight:DescribeDataSet",
13:23:17.709 STDOUT terraform:               + "quicksight:DescribeDataSetPermissions",
13:23:17.709 STDOUT terraform:               + "quicksight:DescribeIngestion",
13:23:17.710 STDOUT terraform:               + "quicksight:ListIngestions",
13:23:17.710 STDOUT terraform:               + "quicksight:PassDataSet",
13:23:17.710 STDOUT terraform:             ]
13:23:17.710 STDOUT terraform:           + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
13:23:17.710 STDOUT terraform:         }
13:23:17.710 STDOUT terraform:       + physical_table_map {
13:23:17.710 STDOUT terraform:           + physical_table_map_id = "notifications"
13:23:17.710 STDOUT terraform:           + relational_table {
13:23:17.710 STDOUT terraform:               + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
13:23:17.710 STDOUT terraform:               + name            = "notifications"
13:23:17.710 STDOUT terraform:                 # (2 unchanged attributes hidden)
13:23:17.710 STDOUT terraform:               + input_columns {
13:23:17.710 STDOUT terraform:                   + name = "id"
13:23:17.710 STDOUT terraform:                   + type = "STRING"
13:23:17.710 STDOUT terraform:                 }
13:23:17.710 STDOUT terraform:               + input_columns {
13:23:17.710 STDOUT terraform:                   + name = "billable_units"
13:23:17.710 STDOUT terraform:                   + type = "INTEGER"
13:23:17.710 STDOUT terraform:                 }
13:23:17.710 STDOUT terraform:               + input_columns {
13:23:17.710 STDOUT terraform:                   + name = "created_at"
13:23:17.710 STDOUT terraform:                   + type = "DATETIME"
13:23:17.710 STDOUT terraform:                 }
13:23:17.710 STDOUT terraform:               + input_columns {
13:23:17.710 STDOUT terraform:                   + name = "queue_name"
13:23:17.710 STDOUT terraform:                   + type = "STRING"
13:23:17.710 STDOUT terraform:                 }
13:23:17.710 STDOUT terraform:               + input_columns {
13:23:17.710 STDOUT terraform:                   + name = "sent_at"
13:23:17.710 STDOUT terraform:                   + type = "DATETIME"
13:23:17.710 STDOUT terraform:                 }
13:23:17.710 STDOUT terraform:               + input_columns {
13:23:17.711 STDOUT terraform:                   + name = "notification_status"
13:23:17.711 STDOUT terraform:                   + type = "STRING"
13:23:17.711 STDOUT terraform:                 }
13:23:17.711 STDOUT terraform:               + input_columns {
13:23:17.711 STDOUT terraform:                   + name = "notification_type"
13:23:17.711 STDOUT terraform:                   + type = "STRING"
13:23:17.711 STDOUT terraform:                 }
13:23:17.711 STDOUT terraform:               + input_columns {
13:23:17.711 STDOUT terraform:                   + name = "updated_at"
13:23:17.711 STDOUT terraform:                   + type = "DATETIME"
13:23:17.711 STDOUT terraform:                 }
13:23:17.711 STDOUT terraform:               + input_columns {
13:23:17.711 STDOUT terraform:                   + name = "job_id"
13:23:17.711 STDOUT terraform:                   + type = "STRING"
13:23:17.711 STDOUT terraform:                 }
13:23:17.711 STDOUT terraform:               + input_columns {
13:23:17.711 STDOUT terraform:                   + name = "api_key_id"
13:23:17.711 STDOUT terraform:                   + type = "STRING"
13:23:17.711 STDOUT terraform:                 }
13:23:17.711 STDOUT terraform:               + input_columns {
13:23:17.711 STDOUT terraform:                   + name = "key_id"
13:23:17.711 STDOUT terraform:                   + type = "STRING"
13:23:17.711 STDOUT terraform:                 }
13:23:17.711 STDOUT terraform:               + input_columns {
13:23:17.711 STDOUT terraform:                   + name = "service_id"
13:23:17.711 STDOUT terraform:                   + type = "STRING"
13:23:17.711 STDOUT terraform:                 }
13:23:17.711 STDOUT terraform:               + input_columns {
13:23:17.711 STDOUT terraform:                   + name = "template_id"
13:23:17.711 STDOUT terraform:                   + type = "STRING"
13:23:17.711 STDOUT terraform:                 }
13:23:17.711 STDOUT terraform:               + input_columns {
13:23:17.711 STDOUT terraform:                   + name = "reference"
13:23:17.711 STDOUT terraform:                   + type = "STRING"
13:23:17.711 STDOUT terraform:                 }
13:23:17.712 STDOUT terraform:               + input_columns {
13:23:17.712 STDOUT terraform:                   + name = "sms_total_message_price"
13:23:17.712 STDOUT terraform:                   + type = "DECIMAL"
13:23:17.712 STDOUT terraform:                 }
13:23:17.712 STDOUT terraform:               + input_columns {
13:23:17.712 STDOUT terraform:                   + name = "sms_total_carrier_fee"
13:23:17.712 STDOUT terraform:                   + type = "DECIMAL"
13:23:17.712 STDOUT terraform:                 }
13:23:17.712 STDOUT terraform:               + input_columns {
13:23:17.712 STDOUT terraform:                   + name = "sms_iso_country_code"
13:23:17.712 STDOUT terraform:                   + type = "STRING"
13:23:17.712 STDOUT terraform:                 }
13:23:17.712 STDOUT terraform:               + input_columns {
13:23:17.712 STDOUT terraform:                   + name = "sms_carrier_name"
13:23:17.712 STDOUT terraform:                   + type = "STRING"
13:23:17.712 STDOUT terraform:                 }
13:23:17.712 STDOUT terraform:               + input_columns {
13:23:17.712 STDOUT terraform:                   + name = "sms_message_encoding"
13:23:17.712 STDOUT terraform:                   + type = "STRING"
13:23:17.712 STDOUT terraform:                 }
13:23:17.712 STDOUT terraform:               + input_columns {
13:23:17.712 STDOUT terraform:                   + name = "sms_origination_phone_number"
13:23:17.712 STDOUT terraform:                   + type = "STRING"
13:23:17.712 STDOUT terraform:                 }
13:23:17.712 STDOUT terraform:             }
13:23:17.712 STDOUT terraform:           + s3_source (known after apply)
13:23:17.712 STDOUT terraform:         }
13:23:17.712 STDOUT terraform:       + physical_table_map {
13:23:17.712 STDOUT terraform:           + physical_table_map_id = "services"
13:23:17.712 STDOUT terraform:           + relational_table {
13:23:17.712 STDOUT terraform:               + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
13:23:17.712 STDOUT terraform:               + name            = "services"
13:23:17.712 STDOUT terraform:                 # (2 unchanged attributes hidden)
13:23:17.713 STDOUT terraform:               + input_columns {
13:23:17.713 STDOUT terraform:                   + name = "id"
13:23:17.713 STDOUT terraform:                   + type = "STRING"
13:23:17.713 STDOUT terraform:                 }
13:23:17.713 STDOUT terraform:               + input_columns {
13:23:17.713 STDOUT terraform:                   + name = "active"
13:23:17.713 STDOUT terraform:                   + type = "INTEGER"
13:23:17.713 STDOUT terraform:                 }
13:23:17.713 STDOUT terraform:               + input_columns {
13:23:17.713 STDOUT terraform:                   + name = "restricted"
13:23:17.713 STDOUT terraform:                   + type = "INTEGER"
13:23:17.713 STDOUT terraform:                 }
13:23:17.713 STDOUT terraform:               + input_columns {
13:23:17.713 STDOUT terraform:                   + name = "research_mode"
13:23:17.713 STDOUT terraform:                   + type = "INTEGER"
13:23:17.713 STDOUT terraform:                 }
13:23:17.713 STDOUT terraform:               + input_columns {
13:23:17.713 STDOUT terraform:                   + name = "count_as_live"
13:23:17.713 STDOUT terraform:                   + type = "INTEGER"
13:23:17.713 STDOUT terraform:                 }
13:23:17.713 STDOUT terraform:               + input_columns {
13:23:17.713 STDOUT terraform:                   + name = "go_live_at"
13:23:17.713 STDOUT terraform:                   + type = "DATETIME"
13:23:17.713 STDOUT terraform:                 }
13:23:17.713 STDOUT terraform:               + input_columns {
13:23:17.713 STDOUT terraform:                   + name = "name"
13:23:17.713 STDOUT terraform:                   + type = "STRING"
13:23:17.713 STDOUT terraform:                 }
13:23:17.713 STDOUT terraform:               + input_columns {
13:23:17.713 STDOUT terraform:                   + name = "message_limit"
13:23:17.713 STDOUT terraform:                   + type = "INTEGER"
13:23:17.713 STDOUT terraform:                 }
13:23:17.713 STDOUT terraform:               + input_columns {
13:23:17.713 STDOUT terraform:                   + name = "rate_limit"
13:23:17.713 STDOUT terraform:                   + type = "INTEGER"
13:23:17.714 STDOUT terraform:                 }
13:23:17.714 STDOUT terraform:               + input_columns {
13:23:17.714 STDOUT terraform:                   + name = "sms_daily_limit"
13:23:17.714 STDOUT terraform:                   + type = "INTEGER"
13:23:17.714 STDOUT terraform:                 }
13:23:17.714 STDOUT terraform:             }
13:23:17.714 STDOUT terraform:           + s3_source (known after apply)
13:23:17.714 STDOUT terraform:         }
13:23:17.714 STDOUT terraform:     }
13:23:17.714 STDOUT terraform:   # aws_quicksight_refresh_schedule.notifications-refreshed will be created
13:23:17.714 STDOUT terraform:   + resource "aws_quicksight_refresh_schedule" "notifications-refreshed" {
13:23:17.714 STDOUT terraform:       + arn            = (known after apply)
13:23:17.714 STDOUT terraform:       + aws_account_id = (known after apply)
13:23:17.714 STDOUT terraform:       + data_set_id    = "notifications-refreshed"
13:23:17.714 STDOUT terraform:       + id             = (known after apply)
13:23:17.714 STDOUT terraform:       + region         = "ca-central-1"
13:23:17.714 STDOUT terraform:       + schedule_id    = "schedule-notifications"
13:23:17.714 STDOUT terraform:       + schedule {
13:23:17.714 STDOUT terraform:           + refresh_type          = "INCREMENTAL_REFRESH"
13:23:17.714 STDOUT terraform:           + start_after_date_time = (known after apply)
13:23:17.714 STDOUT terraform:           + schedule_frequency {
13:23:17.714 STDOUT terraform:               + interval        = "DAILY"
13:23:17.714 STDOUT terraform:               + time_of_the_day = "07:50"
13:23:17.714 STDOUT terraform:               + timezone        = (known after apply)
13:23:17.714 STDOUT terraform:             }
13:23:17.714 STDOUT terraform:         }
13:23:17.714 STDOUT terraform:     }
13:23:17.714 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
13:23:17.714 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
13:23:17.714 STDOUT terraform: Saved the plan to: plan.tfplan
13:23:17.714 STDOUT terraform: To perform exactly these actions, run the following command to apply:
13:23:17.715 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications_refreshed"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.template-category-history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

40 tests, 19 passed, 21 warnings, 0 failures, 0 exceptions

```

</details>
